namespace DNTPersianUtils.Core;

/// <summary>
///     بسته به روش دريافت اطلاعات، عموما يكي از سه روش ارائه شده‌ي در اينجا براي پردازش اطلاعات متني داس مفيد هستند
/// </summary>
public enum TextEncoding
{
    /// <summary>
    ///     متن دريافتي بدن هيچ تغييري استفاده خواهد شد
    /// </summary>
    DontChange = 0,

    /// <summary>
    ///     در اين حالت ابتدا متن ورودي به انكدينگ 1252 تبديل شده و سپس پردازش مي‌شود.
    ///     اگر از يك فايل قديمي سيستم عامل داس و يا از درايور فاكس‌پرو براي دريافت اطلاعات استفاده مي‌كنيد، ممكن است اين
    ///     گزينه‌ي
    ///     مطلوب شما باشد.
    /// </summary>
    CP1252 = 1252,

    /// <summary>
    ///     در اين حالت ابتدا متن ورودي به انكدينگ ويندوز عربي تبديل شده و سپس پردازش مي‌شود
    /// </summary>
    ArabicWindows = 1256,
}